[
  {
    "id": 1,
    "jobtitle": "Digital Marketing Specialist",
    "location": "Hyderabad, India",
    "description": "Join our marketing team to help drive innovative digital marketing strategies for our clients across various industries.",
    "details": {
      "company_description": "Firstclusive Branding is a leading provider of innovative IT solutions, serving over 800 clients worldwide since 2014.",
      "role_description": "The Digital Marketing Specialist will be responsible for planning and executing digital marketing campaigns, including SEO/SEM, email marketing, social media, and PPC advertising.",
      "qualifications": [
        "Strong experience in SEO, SEM, and social media marketing.",
        "Proficiency in Google Analytics, Google Ads, and Facebook Ads Manager.",
        "Ability to develop and execute content strategies.",
        "Knowledge of marketing automation tools.",
        "Strong analytical and problem-solving skills."
      ],
      "bonus": [
        "Experience in influencer marketing.",
        "Familiarity with A/B testing and conversion rate optimization."
      ]
    }
  },
  {
    "id": 2,
    "jobtitle": "Social Media Manager",
    "location": "Hyderabad, India",
    "description": "Seeking a creative Social Media Manager to grow our brand presence across multiple platforms and drive engagement.",
    "details": {
      "company_description": "Firstclusive Branding is a leading provider of innovative IT solutions, serving over 800 clients worldwide since 2014.",
      "role_description": "The Social Media Manager will create and execute social media campaigns, analyze engagement metrics, and collaborate with designers and content creators.",
      "qualifications": [
        "Proven experience in social media marketing and management.",
        "Proficiency in scheduling tools like Hootsuite or Buffer.",
        "Ability to create engaging content and track performance metrics.",
        "Understanding of paid social media advertising strategies.",
        "Excellent copywriting and communication skills."
      ],
      "bonus": [
        "Experience with influencer collaborations.",
        "Knowledge of video editing and graphic design tools."
      ]
    }
  },
  {
    "id": 3,
    "jobtitle": "Content Writer",
    "location": "Hyderabad, India",
    "description": "Looking for a creative Content Writer to develop compelling and SEO-friendly content for websites, blogs, and social media.",
    "details": {
      "company_description": "Firstclusive Branding is a leading provider of innovative IT solutions, serving over 800 clients worldwide since 2014.",
      "role_description": "The Content Writer will research, write, and edit engaging content across multiple platforms to enhance brand awareness and audience engagement.",
      "qualifications": [
        "Strong writing and editing skills with attention to detail.",
        "Knowledge of SEO best practices and keyword research.",
        "Ability to write for different audiences and industries.",
        "Experience with CMS platforms like WordPress.",
        "Excellent time management and organizational skills."
      ],
      "bonus": [
        "Experience in copywriting for ads and sales pages.",
        "Basic knowledge of graphic design and multimedia tools."
      ]
    }
  },
  {
    "id": 4,
    "jobtitle": "Sales Executive",
    "location": "Hyderabad, India",
    "description": "Looking for a driven Sales Executive to generate leads and convert potential clients into long-term business partners.",
    "details": {
      "company_description": "Firstclusive Branding is a leading provider of innovative IT solutions, serving over 800 clients worldwide since 2014.",
      "role_description": "The Sales Executive will be responsible for lead generation, client outreach, and negotiating deals to achieve revenue targets.",
      "qualifications": [
        "Experience in B2B or B2C sales.",
        "Strong negotiation and persuasion skills.",
        "Ability to build relationships with clients.",
        "Proficiency in CRM software like HubSpot or Salesforce.",
        "Goal-oriented with excellent time management."
      ],
      "bonus": [
        "Knowledge of digital marketing sales.",
        "Experience in SaaS or IT service sales."
      ]
    }
  }
]
